In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("structured_missing_data.csv")

In [3]:
df.head()

   ID           Name   Age         City
0   1    Liam Carter  25.0     New York
1   2  Emma Williams   NaN  Los Angeles
2   3   Noah Johnson  30.0          NaN
3   4   Olivia Brown  22.0      Chicago
4   5  William Davis   NaN          NaN

In [4]:
df.shape

(20, 4)

In [5]:
df = df.dropna()

In [6]:
df.shape

(7, 4)

In [7]:
df

    ID          Name   Age          City
0    1   Liam Carter  25.0      New York
3    4  Olivia Brown  22.0       Chicago
5    6  Sophia Green  27.0         Miami
10  11    Mia Thomas  29.0       Seattle
15  16  Amelia Scott  26.0        Austin
17  18  Harper Young  32.0  Philadelphia
19  20  Evelyn Lewis  23.0     San Diego